Tekla Open API Reference for Tekla Structures 2025
BoltArray.AddBoltDistY Method
 Adds a Y distance to the bolt array.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool AddBoltDistY(
	double DistY
)
Public Function AddBoltDistY (
	DistY As Double
) As Boolean
Parameters
DistY
Type: System.Double
The Y distance to be added.
Return Value
Type: Boolean
True if the distance was added. Throws an OverflowException if there was no more space for the distance.
See Also
Reference
BoltArray Class
Tekla.Structures.Model Namespace